{"id":17,"date":"2024-02-14T23:53:03","date_gmt":"2024-02-14T23:53:03","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=17"},"modified":"2024-02-14T23:53:03","modified_gmt":"2024-02-14T23:53:03","slug":"uncontrolled-satellite-will-hit-the-earth-when-and-where","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/uncontrolled-satellite-will-hit-the-earth-when-and-where\/","title":{"rendered":"Uncontrolled satellite will hit the earth, when and where"},"content":{"rendered":"\n<p>A huge useless satellite or artificial satellite weighing several thousand kilograms is coming towards the earth. Astronomers are very worried about the uncontrollable useless satellite. Because, even though the satellite is scheduled to return to Earth this month, there is no chance of it successfully landing safely. And so there is no specific information about when and where the satellite will hit the earth.<\/p>\n\n\n\n<p>The ERS-2 satellite was launched in 1995 to collect data on Earth&#8217;s land, oceans and polar regions. The European Space Agency satellite has been orbiting our planet for almost 30 years. The 2,267 kg satellite will enter Earth&#8217;s atmosphere sometime in the middle of this month. Astronomers believe that part of the satellite will crash into some ocean. They refused to panic because the risk of being injured by space debris is one in 10,000 million.<\/p>\n\n\n\n<p>The full name of the ERS2 satellite is European Remote-Sensing Satellite 2. It was launched on 21 April 1995. It started to stay 487 miles from the surface. At that time it was the most advanced observation spacecraft built by Europe. Satellite data was used for various scientific purposes, including monitoring natural disasters such as severe floods or earthquakes in remote areas of the world. After 2011, the ERS 2 satellite was no longer used. For this, the satellite is removed from the designated orbit.<\/p>\n\n\n\n<p>The European Space Agency said in a message that it is impossible to predict exactly when and where the satellite will hit the Earth. And so the satellite is being monitored very closely. After entering the Earth&#8217;s atmosphere, most of the satellite will burn up and be destroyed when it is 50 miles above the Earth&#8217;s surface. Some fragments may reach the Earth&#8217;s surface. These pieces will not contain any toxic or radioactive material. There is no opportunity to communicate with or control the ERS 2 satellite. The satellite&#8217;s battery is dead. Various parts of communication have become obsolete long ago.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A huge useless satellite or artificial satellite weighing several thousand kilograms is coming towards the earth. Astronomers are very worried about the uncontrollable useless satellite. Because, even though the satellite is scheduled to return to Earth this month, there is no chance of it successfully landing safely. And so there is no specific information about [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":19,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/17"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=17"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/17\/revisions"}],"predecessor-version":[{"id":20,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/17\/revisions\/20"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media\/19"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=17"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=17"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=17"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}