{"id":30,"date":"2024-02-15T14:35:41","date_gmt":"2024-02-15T14:35:41","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=30"},"modified":"2024-02-15T14:35:41","modified_gmt":"2024-02-15T14:35:41","slug":"shakib-can-bowl-without-looking","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/shakib-can-bowl-without-looking\/","title":{"rendered":"&#8216;Shakib can bowl without looking&#8217;"},"content":{"rendered":"\n<p>Jimmy Neesham didn&#8217;t know the news &#8211; Shakib Al Hasan, Neesham&#8217;s teammate in Rangpur Riders in BPL, is playing with an eye problem. However, Shakib&#8217;s runs in the last three matches were 34, 27 and 69. Shakib&#8217;s wickets in these three matches are 3, 2 and 2. Is it possible to perform such an all-round performance with an eye problem or not &#8211; the question was playing on Nisham&#8217;s face after hearing the news after the practice of Rangpur today at Zahur Ahmed Chowdhury Stadium.<\/p>\n\n\n\n<p>The all-rounder from New Zealand said with great surprise, &#8216;It seems that the opposite is helping him after seeing it in the last match. Maybe playing with one eye is easier for him (laughs). He is a great cricketer. I don&#8217;t know what&#8217;s wrong with his eyes. This is the first time I heard the news. Whatever he is doing, let him keep doing it. Because, it&#8217;s working (laughs).&#8217; Later he said, &#8216;Even if he can&#8217;t see, he can still bowl. He will do well in that too.&#8217;<\/p>\n\n\n\n<p>He has seen Shakib as an opponent in international cricket for a long time. Now Nisham sees him as a teammate. Being an all-rounder himself, Neesham knows well the role of an all-rounder like Shakib in the team, &#8216;He is playing brilliantly for us. Having him in the team means having two players. He is one of the best batsmen and also one of the best bowlers. It is a great advantage to have him in the team. He has been performing well in the last few matches. Hopefully, he will retain this form.&#8217;<\/p>\n\n\n\n<p>Shakib Al Hasan at Rangpur Riders practice in ChittagongProthom-alo<br>Neesham has played two matches in BPL so far. The Kiwi all-rounder contributed with the bat-ball to Rangpur&#8217;s win in both the matches. Naturally, Neesham is enjoying the time of BPL very much, &#8216;When you win, the game always seems enjoyable. The atmosphere of the team is quite good now. We are looking forward to the next match.&#8217;<\/p>\n\n\n\n<p>Neesham is not having any problem to adapt as a foreign cricketer. Because the wicket made the work of the batsmen easier in the Chittagong phase of the BPL, &#8216;very good quality cricket is being played. There is a big run match. Which is good news as a batsman. Hopefully, we can play some more big run matches.&#8217;<\/p>\n\n\n\n<p>Jimmy Neesham of Rangpur Riders faced the media in ChittagongProthom-alo<br>The topic of the national team also came up in the discussion of franchise T20 cricket with Neesham. The Bangladesh team has drawn the T20 series in New Zealand last December. Bangladesh, who performed well throughout the series, could have won the series, Neesham said, &#8216;We are lucky that we did not lose the series. If the last match was different, we could have lost the series.&#8217;<\/p>\n\n\n\n<p>Nisham also noticed the continuous improvement of Bangladesh on foreign soil, &#8216;Bangladesh is doing very well in the last few visits to New Zealand. Progressing step by step. Especially the fast bowling department. Earlier, we have defeated Bangladesh by showing power in our conditions. Because, our condition is bouncy and our fast bowlers have more speed and bounce. But in the last two tours I see something different…Bangladesh team now has a bowler like Shariful. He can swing the ball with speed. Also has good bounce. They have played very well in New Zealand. They must be very happy about it.&#8217;<\/p>\n\n\n\n<p>He sees a good chance of Bangladesh in the T20 World Cup next June, &#8216;There is also T20 World Cup ahead. I am sure, no team will take them lightly. Especially in West Indies conditions.&#8217;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Jimmy Neesham didn&#8217;t know the news &#8211; Shakib Al Hasan, Neesham&#8217;s teammate in Rangpur Riders in BPL, is playing with an eye problem. However, Shakib&#8217;s runs in the last three matches were 34, 27 and 69. Shakib&#8217;s wickets in these three matches are 3, 2 and 2. Is it possible to perform such an all-round [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":41,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[2],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/30"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=30"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/30\/revisions"}],"predecessor-version":[{"id":42,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/30\/revisions\/42"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media\/41"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=30"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=30"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=30"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}