{"id":32,"date":"2024-02-15T14:33:49","date_gmt":"2024-02-15T14:33:49","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=32"},"modified":"2024-02-15T14:33:49","modified_gmt":"2024-02-15T14:33:49","slug":"sarfraz-jurels-test-debut-is-also-a-victory-for-parents","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/sarfraz-jurels-test-debut-is-also-a-victory-for-parents\/","title":{"rendered":"Sarfraz-Jurel&#8217;s Test debut is also a victory for parents"},"content":{"rendered":"\n<p>It takes time to sleep at night. But the sun will not rise at my will.&#8217;<\/p>\n\n\n\n<p>A burnt-out life is somewhat philosophical. And all people have some kind of burn marks in their lives. Naushad Khan&#8217;s personal life may also have. But because of the burn he said above, it is not about himself. The scar is his son&#8217;s. The father also suffered from that pain. Sitting in the commentary room, Akash Chopra also smelled the burnt marks. It is understood that the stain is still fresh, but now it may disappear quickly.<\/p>\n\n\n\n<p>If I get a Test cap, I will dedicate it to my father. Because he is my hero. Whenever I am in doubt, he directs me to the right path.<br>Dhruv Jurel<br>the scent? The burning smell is bitter. Naushad&#8217;s life has caught that now as a scent or fragrance. Like all other parents, many sacrifices are made in this one life to see the child where he\/she wants to be because of his\/her merits and still when the dream is not fulfilled, it burns deep inside. But parents don&#8217;t know how to give up for their children. When the dream comes true at the end of the hourglass of waiting and waiting, but the scent of happiness comes from that burnt scar. Happy pain in the chest!<\/p>\n\n\n\n<p>Sarfaraz&#8217;s father Naushad hugs him after receiving his debut cap in the TestAFP<br>Naushad also got such a scent when his elder son Sarfaraz Khan made his international debut for India in Rajkot today. So the call was made in the commentary room as well. How do you feel as a father with such passion for your son, whether Abhishek was a little late or not &#8211; to know these things. That&#8217;s when Naushad gave this metaphorical example. When the word is broken, wait to be called to the national team to say &#8216;night&#8217;. At the end of that wait, Sarfraz emerged as the sun in the national team at the will of the selectors.<\/p>\n\n\n\n<p>Or another &#8216;rising sun&#8217; Dhruva Jurel. This wicketkeeper-batsman also made his debut in the Indian jersey today. He did not have to play &#8216;Test&#8217; on a waiting wicket like Sarfraz. But Sarfraz&#8217;s Jurel&#8217;s story is similar to the sacrifice of his father and mother. Dinesh Karthik handed him the Test cap and said, &#8216;Your father must be watching this scene….&#8217;<\/p>\n\n\n\n<p>Jurel&#8217;s father Nem Singh Jurel is a Kargil War hero. He knows how much effort, how much sacrifice it takes to climb a steep mountain (success). At the age of 5, his son&#8217;s left leg fell under the wheels of a bus in Agra. I was not meant to be a cricketer. Dad didn&#8217;t want it in the beginning either. 14-year-old Jurel advised his son to focus on his studies after asking his father to buy cricket equipment. Because I want a government job. Baba knows the reality. But mother? Ah, all mothers in the world understand this!<\/p>\n\n\n\n<p>Jurel&#8217;s mother sold the gold chain of her neck, fearing that her child&#8217;s dreams would be destroyed by her father&#8217;s rule. The more Jurel climbed the steep mountain, the softer his father&#8217;s heart became. And the son accepts that tender-hard father as &#8216;hero&#8217; &#8211; as most children do! Fathers are probably the first &#8216;superhero&#8217; in every child&#8217;s life. Jurel told the BCCI website, &#8216;If I get a Test cap, I will dedicate it to my father. Because he is my hero. Whenever I am in doubt, he directs me to the right path.&#8217; And mother? Mother&#8217;s ardent, immortal inexhaustible contribution to lightening their hardships, which children have!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>It takes time to sleep at night. But the sun will not rise at my will.&#8217; A burnt-out life is somewhat philosophical. And all people have some kind of burn marks in their lives. Naushad Khan&#8217;s personal life may also have. But because of the burn he said above, it is not about himself. The [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":37,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1,2],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/32"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=32"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/32\/revisions"}],"predecessor-version":[{"id":38,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/32\/revisions\/38"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media\/37"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=32"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=32"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=32"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}