{"id":48,"date":"2024-02-16T07:12:07","date_gmt":"2024-02-16T07:12:07","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=48"},"modified":"2024-02-16T07:12:07","modified_gmt":"2024-02-16T07:12:07","slug":"cpdl-rubicon-corporate-sports-carnival-has-started","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/cpdl-rubicon-corporate-sports-carnival-has-started\/","title":{"rendered":"CPDL Rubicon Corporate Sports Carnival has started "},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/www.banglanews24.com\/public\/uploads\/2024\/02\/15\/1708009970.Untitled-5.jpg\" alt=\"CPDL Rubicon Corporate Sports Carnival has started \"\/><\/figure>\n\n\n\n<p><strong>Dhaka:<\/strong>&nbsp;City Corporate Sports Carnival 2024 has started at CPDL Rubicon City in East Bhatara of the capital. The sports carnival is organized by CPDL Rubicon.<\/p>\n\n\n\n<p>The carnival was inaugurated on Thursday (February 15) evening with a function at CPDL&#8217;s under-construction Happy Condominium Rubicon City project premises in East Vatara of the capital. Representatives of 28 corporate organizations participating in the event were present. &nbsp;<\/p>\n\n\n\n<p>About the goals and objectives of CPDL, the country&#8217;s traditional construction company, President of CPDL Family, Engr. Iftekhar Hossain said, the festive informal sports competition plays an effective role in establishing cordial relations between the supporting institutions. Collaborative business relationships are established as a result, leading to significant improvements in customer service for all parties. This event aims to build stable, long-term and harmonious ties with all the stakeholders in the CPDL value chain such as banks, non-banking financial institutions, construction material manufacturing companies, media, communication and logistics. CPDL plans to make this corporate sports carnival a regular event every year. &nbsp;<\/p>\n\n\n\n<p>Eng. Iftekhar Hossain also said, &#8220;We work with the &#8216;Happy Together&#8217; philosophy, our motto is to move forward with enthusiasm with everyone in an inclusive method and that is why we are organizing this sports sports carnival, and we hope to bring more different initiatives like this in the future.<\/p>\n\n\n\n<p>Chief Business Officer of CPDL Ziaul Haque Khan said that 103 teams from 28 corporate organizations will participate in a total of 90 matches in these two categories of Badminton and Human Futsal in this seven-day carnival. As a result, CPDL Rubicon City &#8211; The Happy Condominium will be busy with the spontaneous participation of the representatives of these top institutions of the country every day. In addition to the competition, a musical performance and an opening ceremony decorated with pitha-puli organized in a rural atmosphere was held. &nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dhaka:&nbsp;City Corporate Sports Carnival 2024 has started at CPDL Rubicon City in East Bhatara of the capital. The sports carnival is organized by CPDL Rubicon. The carnival was inaugurated on Thursday (February 15) evening with a function at CPDL&#8217;s under-construction Happy Condominium Rubicon City project premises in East Vatara of the capital. Representatives of 28 [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/48"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=48"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/48\/revisions"}],"predecessor-version":[{"id":59,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/48\/revisions\/59"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=48"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=48"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=48"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}