{"id":63,"date":"2024-02-19T05:20:01","date_gmt":"2024-02-19T05:20:01","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=63"},"modified":"2024-02-19T05:20:01","modified_gmt":"2024-02-19T05:20:01","slug":"bashundhara-group-is-playing-a-special-role-in-education-imdadul-haque-milan","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/bashundhara-group-is-playing-a-special-role-in-education-imdadul-haque-milan\/","title":{"rendered":"Bashundhara Group is playing a special role in education: Imdadul Haque Milan"},"content":{"rendered":"\n<p><img decoding=\"async\" src=\"https:\/\/www.banglanews24.com\/public\/uploads\/2024\/02\/17\/1708184092.Bashundhara-Shuvasangh-Scho.jpg\" alt=\"Bashundhara Group is playing a special role in education: Imdadul Haque Milan\"><\/p>\n\n\n\n<p><a href=\"https:\/\/ep1.infostation.digital\/rtb\/clicks?n=j2a2b5mEIX9HbkBP118qhDQ4yIYbkXT2Op8%2FIO0nakDNIoNbQBlhPj70wyGBRP85r3tzb8ztXNE5sVVRxo%2BmZYgBvoMXRS5HqUbUmmaT3O8RvvMUlrjFt9kDfo6BjUl0KJRQLGDw5MsWEmdtDUEh4Y2Z3PUev8bFNtjw47dQLr8qTAYducFLwSUAYWYxk3AgX4saIdKO8QS8h4s3DZCzaCi6vz8V%2B8Juom3kJ3waBdWEUFlqbSZ6xKhK9y%2BeEU4Cj4LXuEOJJqWpxkXwHgL%2BsEn1n6QCycbQ7fk2bOYm\" target=\"_blank\" rel=\"noreferrer noopener\"><\/a><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>Gaibandha:<\/strong>&nbsp;Legendary fiction writer Imdadul Haque Milan said that Bashundhara Group, the largest industrial group of the country, is working tirelessly to spread the light of education in the remote areas of the country.<\/p>\n\n\n\n<p>He said this while addressing the chief guest at Bashundhara Shubasangh School distribution ceremony at Goghat area of ​​Kamarjani Union of Gaibandha Sadar Upazila on Saturday (February 17) noon.<\/p>\n\n\n\n<p>Chief Editor of Dainik Kaler Kantha Imdadul Haque Milan said Bashundhara Group is working for the welfare of the country and people. They have a major role in eradicating poverty in the country. Besides, the industrial institute is spreading the light of education in remote areas of the country. &nbsp;<\/p>\n\n\n\n<p>With the help of the Bashundhara group, schools have been established in different areas of Bangladesh and sewing training centers have been set up to empower poor women. In continuation of that, a school has been established by Bashundhara Shubasangh in Kamarjani area. &nbsp;<\/p>\n\n\n\n<p>We have a plan to purchase our own land and construct buildings in every district and sub-district of the country. Bashundhara Shuvasangha will have one such school and building in each district, from where we will conduct all the work. &nbsp;<\/p>\n\n\n\n<p>Zarina Begum, mother of Monalisa Akhtar Mafia and Momena Begum, mother of Abdullah Al-Mamun, who are studying in children&#8217;s class at Bashundhara Shuvasangh School in Goghat, said that our boys and girls could not go to school due to the distance. We are poor people, the teachers of Bashundhara have built a school in Goghat. Our children now study in this school. Goes to school regularly. Get everything from school dresses here. We are all very happy.<\/p>\n\n\n\n<p>Bashundhara Shuvasangh school teacher Rita Akhtar said that due to this great initiative of Bashundhara Shuvasangh, the underprivileged children of this area are able to learn. I am very happy to be able to teach education to these underprivileged children. I express my gratitude to the Chairman of Bashundhara Group for this.<\/p>\n\n\n\n<p>It is known that a school was established last year with the funding of Bashundhara Group for underprivileged children in Goghat area of ​​Kamarjani Union of Gaibandha Sadar Upazila under the initiative of Bashundhara Shubasangha. 50 students are being taught in the school. The families of most of the students of this school are low income people. These students did not study in any school before. Bashundhara Shuvasangh School is providing free tuition. This makes the students and their parents happy. 50 young students and their parents express their gratitude to Bashundhara Shubasangha by receiving these educational materials.<\/p>\n\n\n\n<p>Bangladesh Time: 2132 Hours, February 17, 2024<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Gaibandha:&nbsp;Legendary fiction writer Imdadul Haque Milan said that Bashundhara Group, the largest industrial group of the country, is working tirelessly to spread the light of education in the remote areas of the country. He said this while addressing the chief guest at Bashundhara Shubasangh School distribution ceremony at Goghat area of ​​Kamarjani Union of Gaibandha [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/63"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=63"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/63\/revisions"}],"predecessor-version":[{"id":84,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/63\/revisions\/84"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=63"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=63"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=63"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}