{"id":66,"date":"2024-02-19T05:16:57","date_gmt":"2024-02-19T05:16:57","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=66"},"modified":"2024-02-19T05:16:57","modified_gmt":"2024-02-19T05:16:57","slug":"teachers-day-is-celebrated-with-respect-and-love-on-rabi","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/teachers-day-is-celebrated-with-respect-and-love-on-rabi\/","title":{"rendered":"Teacher&#8217;s Day is celebrated with respect and love on Rabi"},"content":{"rendered":"\n<p><img decoding=\"async\" src=\"https:\/\/www.banglanews24.com\/public\/uploads\/2024\/02\/18\/1708250044.0.jpg\" alt=\"Teacher's Day is celebrated with respect and love on Rabi\"><a href=\"https:\/\/ep1.infostation.digital\/rtb\/clicks?n=DSuAqUlXPnt6D0DZhNruq%2FeQdcVd0sU7otnrW2jUQuz8kzvojwbM1mmwa8MZpN2CF4wAZdM2lldYXqkcuIfPAWjmzrnmw4kwoPN7j468%2FsmVh2AT5AuTGo7muNHvFwi3YBjK8CjubfO8ztvVLmF13gqyDBmaK%2BOpAU6fkxVSJmmhnictxtPPAX2f%2BV9sYhFMSNr3R46lSei%2BxYnHRAWb2yGuc7UfnqKTf6Zsj%2BYXsRPLUDn3%2By1NbwevrFJ2hC%2FZWWq8Hi4NYdiLlfbOpuszsri85oP9ls%2Brr7n33omD\" target=\"_blank\" rel=\"noreferrer noopener\"><\/a><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>Rajshahi:<\/strong>&nbsp;Teachers&#8217; Day was celebrated with deep respect and love in Rajshahi University (Rabi) on Sunday (February 18). &nbsp;<\/p>\n\n\n\n<p>Rajshahi University chemistry department teacher Dr. Syed Muhammad Shamsujjoha was killed by Pakistani troops while serving as proctor.He is the first martyr intellectual of this country.<\/p>\n\n\n\n<p>In the program of the day, black flags were hoisted at Shaheed Syed Nazrul Islam Administration Building, Vice-Chancellor Building and other buildings of the university on Sunday morning.<\/p>\n\n\n\n<p>At 9 am Vice-Chancellor Prof. Golam Sabbir Sattar, Vice-Chancellor (Administration) Prof. Sultan-ul-Islam, Vice-Chancellor (Education) Prof. Humayun Kabir, Treasurer Prof. Abaidur Rahman Pramanik and senior officials of the administration were martyred. He offered wreaths at Joha&#8217;s tomb and Joha memorial. Later there is a minute of silence and prayer for the forgiveness of his soul. &nbsp;<\/p>\n\n\n\n<p>After that, chemistry department and Shaheed Shamsujjoha Hall and other residential halls, departments, Rabi School and Sheikh Russel Model School, Teachers Association, Progressive Teachers Society believing in the spirit and values ​​of the Liberation War, Officers Association and other professional associations and unions including halls, departments paid tribute to Shaheed Johar&#8217;s mausoleum and memorial. By assigning<\/p>\n\n\n\n<p>Joha memorial speech was held at Shaheed Tajuddin Ahmad Senate building at 10 am. Nazrul Islam Khan, former education secretary and Curator of Father of the Nation Bangabandhu Sheikh Mujibur Rahman Memorial Museum gave a speech titled &#8216;Our Education Thought&#8217;.<\/p>\n\n\n\n<p>Rabi Vice Chancellor Professor Golam Sabbir Sattar was the chief guest here. &nbsp;<\/p>\n\n\n\n<p>Special guests were Vice-Chancellor (Administration) Prof. Sultan-ul-Islam, Vice-Chancellor (Education) Prof. Humayun Kabir, Treasurer Prof. Abaidur Rahman Pramanik.<\/p>\n\n\n\n<p>Professor Chowdhury, president of the chemistry department. Zakaria presided over it.<\/p>\n\n\n\n<p>Among others, the former vice-chancellor of the university Prof. Abdul Khalek also spoke there. Eminent teachers, officials and many others were present on the occasion.<\/p>\n\n\n\n<p>Commemorative speaker Nazrul Islam Khan said that education is general preparation for life. This preparation varies by country, climate and culture. This preparation is also different with time. In the Middle Ages horsemanship and swordsmanship were taught in good schools. Today it may be a criminal activity. I say general preparation because it is not possible to do any job smoothly in career only with education. To do any job efficiently in career requires training. Education is not a substitute for training nor is training a substitute for education. Education and training are not the last words. Applying the knowledge, skills and attitudes acquired through education and training in real life results in the acquisition of new knowledge, skills and attitudes which can be called experience. There is no substitute for experience.<\/p>\n\n\n\n<p>In his speech, Nazrul Islam Khan discussed various aspects of primary and secondary education and said about higher education, the number of seats in public universities is about 60 thousand, in private universities 2 lakh 38 thousand 323 and in national universities the number of seats is 11 lakh 30 thousand 32 which is a total of about 14 lakh. Notable universities have higher number of seats than demand but the largest section has considerable dissatisfaction with the teaching environment and quality.<\/p>\n\n\n\n<p>Although there is a demand for new subjects in higher education, there is no initiative to close old departments or reduce the number of students. On the other hand, new departments are not opened or opened according to the market demand.<br>The more educated we are, the more we enjoy. As the old saying goes, &#8216;Education is the one who drives the carriage&#8217;. While a farmer is satisfied with prawns, we highly educated people aspire to eat shark fin soup from crabs in the mangroves.<\/p>\n\n\n\n<p>Whether those who believe in statesmen and democratic practices are pushing nature towards destruction while appeasing the people. The greatest idea of ​​today&#8217;s education is how to bring about sustainable development in the world by combining our mutual conflicts.<\/p>\n\n\n\n<p>In the event, the vice chancellor said that the concept of education in the world is wide and wide. Knowledge and ideas are always flowing and evolving. Education sharpens intellect, inspires people to patriotism. Shahid Dr. Zoha was a humanist, he is the source of humanist thought in the world. Shaheed Johar&#8217;s life philosophy, thought-consciousness has given the Bengali nation immense inspiration to fulfill their responsibilities and duties inspired by patriotism.<\/p>\n\n\n\n<p>Meanwhile, the teacher&#8217;s day program also included recitation of the Koran and special prayers at the Central Jame Masjid on Bad Zohar Rabi. &nbsp;<\/p>\n\n\n\n<p>At 4 pm there is prayer ceremony at Shaheed Shamsujjoha Hall, lamp lighting and film screening at Shaheed Shamsujjoha Hall&#8217;s spark square in the evening. On this day, the Shaheed Memorial Museum is open for visitors from 8 am to 4 pm.<\/p>\n\n\n\n<p>Bangladesh Time: 1553 hours, February 18, 2024<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Rajshahi:&nbsp;Teachers&#8217; Day was celebrated with deep respect and love in Rajshahi University (Rabi) on Sunday (February 18). &nbsp; Rajshahi University chemistry department teacher Dr. Syed Muhammad Shamsujjoha was killed by Pakistani troops while serving as proctor.He is the first martyr intellectual of this country. In the program of the day, black flags were hoisted at [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/66"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=66"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/66\/revisions"}],"predecessor-version":[{"id":81,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/66\/revisions\/81"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=66"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=66"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=66"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}