{"id":70,"date":"2024-02-19T05:15:00","date_gmt":"2024-02-19T05:15:00","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=70"},"modified":"2024-02-19T05:15:00","modified_gmt":"2024-02-19T05:15:00","slug":"opportunity-to-study-in-uk-university-sitting-in-dhaka","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/opportunity-to-study-in-uk-university-sitting-in-dhaka\/","title":{"rendered":"Opportunity to study in UK university sitting in Dhaka"},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/www.banglanews24.com\/public\/uploads\/2024\/02\/18\/1708270419.mocs.jpg\" alt=\"Opportunity to study in UK university sitting in Dhaka\"\/><\/figure>\n\n\n\n<p><strong>Dhaka:<\/strong>&nbsp;A delegation from the University of London, UK has come to Dhaka to meet students studying in their distance learning programme. The delegation visited their recognized educational centers in Bangladesh.<\/p>\n\n\n\n<p>Bangladeshi students can study at any of the seven accredited educational centers affiliated to the university or independently choose online distance learning.<\/p>\n\n\n\n<p>About the visit to Dhaka, University of London Pro Vice-Chancellor Professor Mary Stasney OBE said that the University of London has been working with partners in Bangladesh for almost 40 years. We have strong relationships with RTCs across the country. As we know, Bangladeshi students are enthusiastic about educational facilities. We look forward to meeting students studying on our courses and hearing stories about their dreams for the future.<\/p>\n\n\n\n<p>Later this year, we will share those stories to inspire people across Bangladesh to consider higher education in the UK and study at the University of London, he added.<\/p>\n\n\n\n<p>The delegation met the students of London College of Legal Studies (South) in Dhaka on February 15. The college was established in 2014 to provide high quality education for students interested in qualifying as barristers of the English and Welsh Bars.<br>&nbsp;<br>The delegation also interviewed various students and gathered their first-hand experience of what it is like to study in Bangladesh on a highly prestigious degree course at the University of London. How a University of London degree is helping students achieve their career goals is also discussed in detail.<\/p>\n\n\n\n<p>On February 16, the delegation visited Bhuiyan Academy, the oldest accredited distance learning center in Bangladesh working with the University of London. Bhuiyan Academy offers high quality courses from LLB to BSc Business Administration with modern facilities and offers University of London programs since 1989.<\/p>\n\n\n\n<p>An official of LCLS (South) said, “We are thrilled to witness the extraordinary achievements of our alumni. Mohammad Taqi Yasir is a graduate of University of London who has not only excelled in his academic journey but has also been recognized with various prestigious awards. He has been shortlisted for the British Council Alumni Award and Forbes 30 Under 30 for his social impact. As we create a dynamic environment for our students, we look forward to inspiring more success stories and contributing to the growth and development of our global community.<\/p>\n\n\n\n<p>A senior official of Bhuiyan Academy further said, “We are a quality education institution and have been offering University of London programs since 1989. Our students&#8217; progress is regularly monitored through classes and assessments. When required, mock trials, debates and seminars are arranged to gain legal experience. We strive for excellence through our strong structural position and alumni network.<\/p>\n\n\n\n<p>Many law graduates from the University of London in Bangladesh are practicing advocates or other prestigious legal roles in the Supreme Court of Bangladesh. Among them are many lawyers including Dhaka Bar Association lawyers, Bangladesh Supreme Court lawyers and Chittagong District and Sessions Court lawyers.<\/p>\n\n\n\n<p>Bangladesh Time: 2133 hours, February 18, 2024<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dhaka:&nbsp;A delegation from the University of London, UK has come to Dhaka to meet students studying in their distance learning programme. The delegation visited their recognized educational centers in Bangladesh. Bangladeshi students can study at any of the seven accredited educational centers affiliated to the university or independently choose online distance learning. About the visit [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/70"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=70"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/70\/revisions"}],"predecessor-version":[{"id":77,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/70\/revisions\/77"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=70"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=70"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=70"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}