{"id":72,"date":"2024-02-19T05:14:02","date_gmt":"2024-02-19T05:14:02","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=72"},"modified":"2024-02-19T05:14:02","modified_gmt":"2024-02-19T05:14:02","slug":"ssc-exam-is-going-on-under-the-umbrella","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/ssc-exam-is-going-on-under-the-umbrella\/","title":{"rendered":"SSC exam is going on under the umbrella!"},"content":{"rendered":"\n<p><img decoding=\"async\" src=\"https:\/\/www.banglanews24.com\/public\/uploads\/2024\/02\/19\/1708307242.4.jpg\" alt=\"SSC exam is going on under the umbrella!\"><\/p>\n\n\n\n<p><a href=\"https:\/\/ep1.infostation.digital\/rtb\/clicks?n=rqfImNz1KFSFsgfr%2BO5O3Jrbn0fqEJCZn6SweJKNJ1PclN8RYPRg80TSIGeVoiGMOHzflC%2FYDSoro6dQrl%2FHbDbMERt%2F5x5vUqbeDWnXhZ8BlpkJv0ZaguaUy4yTUtq5L4FHxzUyGdz%2FGjhZeqb4g5zFXs169ZWxEByJYcCwGstReZk0bekPX6gyxY4DCXtW%2BNUughS5Tt1WIuqoIN6SDT%2Fz0ORE8eY1UCdpmh3ffiqpPWriXnSIv0DtL32ZfG7%2B2VOU7U2UVT7A0a9qoalRNn61Ud%2BEqLNS%2BVRTGX9S\" target=\"_blank\" rel=\"noreferrer noopener\"><\/a><\/p>\n\n\n\n<p><\/p>\n\n\n\n<p><strong>Jamalpur:<\/strong>&nbsp;At first glance, it may seem like a wedding is being organized. But no; This is not a wedding ceremony canopy.Surprisingly, the Madhyamik School Certificate (SSC) examination is going on in this shamiana pandal.<\/p>\n\n\n\n<p>The incident took place on Sunday (February 18) at Kalabadha Multipurpose High School Examination Center in Melandah Upazila of Jamalpur. Upazila executive officers including education officers do not know anything about this incident.<\/p>\n\n\n\n<p>It is reported that the students of four schools appeared for the Secondary School Certificate (SSC) examination at this centre. 432 SSC (General) students and 272 SSC (Vocational) students of Technical Education Board are taking the exam in this centre. Among them, 120 people are taking the exam under the canopy. Kalabadha Govt Primary School is the venue next to the Kalabadha Multipurpose High School Examination Center as there is no rule for students of the same school to take the exam in the same school examination centre.<\/p>\n\n\n\n<p>The parents of some students who took part in the exam inside the shade said, &#8216;Exams are being conducted inside the field by pulling the shade. Kalabdha Girls High School was a little away next to this center which could have been the center for the examination. But instead of doing that, the primary school attached to this center makes a venue as an examination center. There is a shortage of seats as the primary school has one building. So he is taking the test by pulling the awning in the field. What will happen if it suddenly rains during the exam! It is never right to take an exam like this.<\/p>\n\n\n\n<p>Center Secretary of Kalabadha Multipurpose High School Examination Center. Munayem said, &#8216;Students of Kalabadha Multipurpose High School are taking the exam at Kalabadha Government Primary School venue. The primary school building has been awninged due to shortage of seats. First Exam Kalabdha Multipurpose High School students have their academy building exam. Talked with the upazila executive officer about this matter. They asked to submit an application. We will apply today.<\/p>\n\n\n\n<p>Upazila Secondary Education Officer Azadur Rahman Bhuiyan said that there is no rule for students of the same school to take the exam in the same school&#8217;s examination center. And I don&#8217;t know about Shamiana, I just heard about it from you. I will find out and take necessary measures.<\/p>\n\n\n\n<p>In this regard, Melandah Upazila Nirbahi Officer (Additional Charge) Faizul Wasima Nahat said, without informing us, they took the test by pulling the curtain. We have informed the senior officials about this.<\/p>\n\n\n\n<p>Bangladesh Time: 0741 hrs, February 7, 2024<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Jamalpur:&nbsp;At first glance, it may seem like a wedding is being organized. But no; This is not a wedding ceremony canopy.Surprisingly, the Madhyamik School Certificate (SSC) examination is going on in this shamiana pandal. The incident took place on Sunday (February 18) at Kalabadha Multipurpose High School Examination Center in Melandah Upazila of Jamalpur. Upazila [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/72"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=72"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/72\/revisions"}],"predecessor-version":[{"id":75,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/72\/revisions\/75"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=72"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=72"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=72"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}