{"id":73,"date":"2024-02-19T05:13:26","date_gmt":"2024-02-19T05:13:26","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=73"},"modified":"2024-02-19T05:13:26","modified_gmt":"2024-02-19T05:13:26","slug":"education-ministers-call-to-universities-to-create-jalbol-according-to-the-needs-of-the-industry","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/education-ministers-call-to-universities-to-create-jalbol-according-to-the-needs-of-the-industry\/","title":{"rendered":"Education Minister&#8217;s call to universities to create Jalbol according to the needs of the industry"},"content":{"rendered":"\n<p><img decoding=\"async\" src=\"https:\/\/www.banglanews24.com\/public\/uploads\/2024\/02\/19\/1708317722.Untitled-3.jpg\" alt=\"Education Minister's call to universities to create Jalbol according to the needs of the industry\"><\/p>\n\n\n\n<p><a href=\"https:\/\/ep1.infostation.digital\/rtb\/clicks?n=4QvXhR%2Bnvs3iYAm%2F32sc1t3QMCOiog8mZ1nj5iqnJqPPqSqzAMAtk0e9hrTynRTLYXzpbpZCBf58ceaVbdQulcdYd63e3HFfO8dOr6sQQB5WOCUFubQvdfR5Bpz6Om9dQhhD8XbsCaQCkKhZuoSrva0ZvCkN0wWlfx9PMBP42xPf53%2FmlnEW9y4PkrLwXtJaGY9xJ%2Fm8rx2PGgAFo813gZPe50ndut0hPoqzHFvgHCQSGaz6HIn0nm7al7fiHJ04q1AyPxLlQ6bE%2BGCrNTxPql%2FoyXaEmdIaJh6CpS3f\" target=\"_blank\" rel=\"noreferrer noopener\"><\/a><\/p>\n\n\n\n<p><a href=\"https:\/\/ep1.infostation.digital\/rtb\/clicks?n=4QvXhR%2Bnvs3iYAm%2F32sc1t3QMCOiog8mZ1nj5iqnJqPPqSqzAMAtk0e9hrTynRTLYXzpbpZCBf58ceaVbdQulcdYd63e3HFfO8dOr6sQQB5WOCUFubQvdfR5Bpz6Om9dQhhD8XbsCaQCkKhZuoSrva0ZvCkN0wWlfx9PMBP42xPf53%2FmlnEW9y4PkrLwXtJaGY9xJ%2Fm8rx2PGgAFo813gZPe50ndut0hPoqzHFvgHCQSGaz6HIn0nm7al7fiHJ04q1AyPxLlQ6bE%2BGCrNTxPql%2FoyXaEmdIaJh6CpS3f\" target=\"_blank\" rel=\"noreferrer noopener\"><\/a><em>volume_off<\/em><\/p>\n\n\n\n<p><strong>Dhaka:<\/strong>&nbsp;Education Minister Mahibul Hasan Chowdhury has called for developing skilled manpower in the country&#8217;s educational institutions in coordination with the needs of the country&#8217;s industrial and commercial institutions. He appealed to the university authorities to improve the skills of the students on soft knowledge beyond the prescribed subjects.<\/p>\n\n\n\n<p>The Minister of Education said this while addressing the chief guest at the inauguration of the Improving Computer and Software Engineering Tertiary Education Project (ICSETEP) being implemented by the Bangladesh University Grants Commission (UGC). &nbsp;<\/p>\n\n\n\n<p>On Sunday (February 18) UGC Chairman (Additional Charge) Prof. Dr. Muhammad Alamgir. Dhaka University Vice-Chancellor Professor Dr. ASM Maksud Kamal, Vice-Chancellor of Bangladesh University of Engineering and Technology. Satya Prasad Majumdar, Vice Chancellor of Jessore University of Science and Technology. Md. Anwar Hossain and Asian Development Bank (ADB) Country Director Edimon Ginting delivered special guest speeches. In the event, UGC member professor Dr. Md. Sajjad Hossain, Professor Dr. Md. Abu Taher, Professor Dr. Hasina Khan, senior officials of Ministry of Education, Asian Development Bank and UGC, professors of CSE\/IT departments of various universities participated. &nbsp;<\/p>\n\n\n\n<p>The project will be implemented in Dhaka University, Bangladesh University of Engineering and Jessore University of Science and Technology under the supervision of UGC. Through the project, modern curriculum, infrastructure, modern labs of CSE department will be developed in these universities. Besides, assistance will be provided for conducting research on information technology in all universities.<\/p>\n\n\n\n<p>The Education Minister called on the concerned universities to look into the fact that ICSETEP is being implemented in three universities so that the teachers and students of other universities can enjoy the benefits of this project. He further said that ICT issues are always changing. Therefore, the university authorities have to take necessary measures to bring changes in the university curriculum along with the changes. &nbsp;<\/p>\n\n\n\n<p>In the President&#8217;s speech, Professor Alamgir said that the ICSETEP project will bring qualitative changes in the country&#8217;s higher education, especially in the information and communication technology sector. The project will enhance the skills of IT students and bridge the knowledge gap between professionals and students and create a bridge between the university and industry. &nbsp;<\/p>\n\n\n\n<p>Director of Planning and Development Department of UGC, Mohammad Makchudur Rahman Bhuiyan, UGC Secretary Dr. Ferdous Zaman spoke. In the event, the project director of the ICSETEP project, Prof. Dr. Md. Aminul Haque Akand outlined the overall aspect of the project.<\/p>\n\n\n\n<p>Under this project, skilled human resources in the ICT sector will be created and communication and network will be established with industrial establishments. This project will be helpful in bringing changes in the production process by providing technologically skilled manpower to various labor dependent sectors of the country. &nbsp;<\/p>\n\n\n\n<p>The implementation cost of the ICSETP project undertaken for the development of the ICT sector in the country and the development of skilled manpower has been estimated at around Tk 1300 crore. The Asian Development Bank (ADB) will bear 87.72 percent of the total cost and the Bangladesh government will bear the remaining 12.28 percent.<\/p>\n\n\n\n<p>Bangladesh Time: 1040 hours, February 19, 2024<\/p>\n","protected":false},"excerpt":{"rendered":"<p>volume_off Dhaka:&nbsp;Education Minister Mahibul Hasan Chowdhury has called for developing skilled manpower in the country&#8217;s educational institutions in coordination with the needs of the country&#8217;s industrial and commercial institutions. He appealed to the university authorities to improve the skills of the students on soft knowledge beyond the prescribed subjects. The Minister of Education said this [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/73"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=73"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/73\/revisions"}],"predecessor-version":[{"id":74,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/73\/revisions\/74"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=73"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=73"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=73"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}