{"id":85,"date":"2024-02-20T08:17:17","date_gmt":"2024-02-20T08:17:17","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=85"},"modified":"2024-02-20T08:17:17","modified_gmt":"2024-02-20T08:17:17","slug":"allah-will-grant-the-righteous-people-a-place-in-paradise","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/allah-will-grant-the-righteous-people-a-place-in-paradise\/","title":{"rendered":"Allah will grant the righteous people a place in Paradise"},"content":{"rendered":"\n<p>Allah has promised the believers Paradise. That is why the God-given way of life must be steadfast in Islam.All the prophets and messengers preached the religion given by God. Hazrat Adam (AS) was the first Prophet. Muhammad (pbuh) is the last prophet. The way of life preached by him is called Islam. &nbsp;<\/p>\n\n\n\n<p>Abdullah Ibn Umar (R.A.) narrated that the Messenger (S.A.W.) said, &#8216;Islam is founded on five pillars. 1. Bearing witness that there is no god but Allah and Muhammad (PBUH) is the Messenger of Allah 2. Establishing Salat 3. Giving Zakat 4. Performing Hajj and fasting for 5 months of Ramadan. &#8216; Bukhari, Muslim, Mishkat.<\/p>\n\n\n\n<p>Those who are committed to the five pillars on which Islam is founded are Imandars or Muslims. Believers must believe in Allah, His angels, His Messenger (PBUH) and the Day of Resurrection. &nbsp;<br>Abu Hurairah (RA) narrated, &#8216;One day when the Messenger (PBUH) was sitting in front of the people, a person came to him and asked him, what is Iman? He said, Iman is that you believe in Allah, in His angels, in meeting Him (on the Day of Resurrection) and in His Messengers. &#8216; Bukhari, Muslim.<\/p>\n\n\n\n<p>If you want to be honest, you have to accept the oneness of Allah and you have to develop yourself as a responsible and holy minded person in all areas.<\/p>\n\n\n\n<p>Abu Huraira (RA) narrated that the Messenger (PBUH) said, &#8216;Iman has more than 70 branches. The best of them is to say La ilaha illallah and the least is to remove the painful things from the path or road and shame is a branch of faith. &#8216; Muslim, Bukhari.<\/p>\n\n\n\n<p>As explained in the above hadith, besides unhesitatingly accepting Almighty Allah as Lord, the faithful must also prove themselves as good people. It is also indicated in this hadith that it is the duty of an imandar to remove obstacles that are painful for people on the way. The faithful are urged to be shy. People who are shy can keep themselves free from bad habits.<\/p>\n\n\n\n<p>Allah has promised the believers a place in Paradise in the Hereafter. It is said, &#8216;For those who believe and do good deeds, there is the Garden of Firdaus. There they will be permanent. Do not seek transfer from there. &#8216; Surah Kahf, verses 107-108.<\/p>\n\n\n\n<p>May Allah grant us all to be honest.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Allah has promised the believers Paradise. That is why the God-given way of life must be steadfast in Islam.All the prophets and messengers preached the religion given by God. Hazrat Adam (AS) was the first Prophet. Muhammad (pbuh) is the last prophet. The way of life preached by him is called Islam. &nbsp; Abdullah Ibn [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/85"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=85"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/85\/revisions"}],"predecessor-version":[{"id":96,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/85\/revisions\/96"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=85"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=85"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=85"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}