{"id":86,"date":"2024-02-20T08:16:56","date_gmt":"2024-02-20T08:16:56","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=86"},"modified":"2024-02-20T08:16:56","modified_gmt":"2024-02-20T08:16:56","slug":"islam-calls-for-frugality","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/islam-calls-for-frugality\/","title":{"rendered":"Islam calls for frugality"},"content":{"rendered":"\n<p>Frugality is moderation in spending in daily life. That is, to spend according to need or calculation without being miserly.Thrift increases people&#8217;s wealth and opens the way to help others. Frugal people are never destitute.<\/p>\n\n\n\n<p>Thrift is one of the characteristics of a believer. From the verse number 63 of Surah Furqan of the Holy Qur&#8217;an, Almighty Allah has described some of the characteristics of His merciful believers. One of them is frugality. It has been said, &#8216;(The servants of Rahman are those) who do not waste and do not miserly. Their approach is between the two. (Surah: Furqan, verse: 67)<\/p>\n\n\n\n<p>World Thrift Day is observed on October 31 worldwide to encourage the people of the world to become thrifty. Islam has repeatedly enjoined thrift, warning against extravagance, extravagance and miserliness. But it is not only for one day but it is the rule of Islam to adopt the path of frugality throughout life. And not just moderation in spending; Rather, there is a command of moderation in speech and walking in Islam. It is said, &#8216;Be moderate in walking and lower your voice. (Surah: Luqman, verse: 19)<\/p>\n\n\n\n<p>Islam has taught us to adopt a balanced and moderate approach by abandoning excesses and indulgences in all cases. In the Holy Qur&#8217;an, it is said to the Muslims, &#8216;Thus have I made you a moderate community. (Surah: Baqarah, verse: 143)<\/p>\n\n\n\n<p>Allah Almighty has given all the necessities of life to man.<\/p>\n\n\n\n<p>Apart from receiving sustenance, he also warned that there should be no wastage. It is said, &#8216;Eat and drink, and waste not; He (Allah) does not love the wasteful. (Surah: Araf, verse: 32)<\/p>\n\n\n\n<p>If the surplus wealth or food is not wasted and poured into the empty pots of the poor, on the one hand, the sin of wastage is saved, and on the other hand, the empty pots come back to life. For this reason, in the Qur&#8217;an, the thrifty are called &#8216;servants of the Most Merciful&#8217; and the spendthrifts are called the brothers of Satan. It has been said, &#8216;Give the relatives their due and also the needy and the traveler. And don&#8217;t waste anything. Verily the spendthrifts are the brothers of Satan. (Surah Bani Israel, Verses 26-27)<\/p>\n\n\n\n<p>Sadly, some people are choosing to be brothers of Satan rather than &#8216;servants of Rahman&#8217;. Waste has now become a symbol of nobility in our society. Food waste is a fashion. On the one hand, billions of people in the world still do not get three meals a day, on the other hand, one-third of the total food produced in the world is wasted. According to the Food and Agriculture Organization of the United Nations (FAO), about 1.3 billion tons of food is wasted annually. If even one-fourth of this huge amount of wasted food could be saved, it would meet the food needs of 87 crore people. (Yugantar : January 6, 2018)<\/p>\n\n\n\n<p>Waste should be avoided as well as wastage. Rasul Karim (pbuh) was strict against wastage. Once Rasulullah (s.a.) saw Sa&#8217;d (ra.) spending excess water in the ajr and said, &#8216;O Sa&#8217;d! Why are you wasting? Saad (RA) said, what is wasted in ablution? The Prophet (PBUH) said, &#8216;Yes. Even if you sit in a flowing river, if you use extra water, it is wasteful. (Ibn Majah, Hadith: 425)<\/p>\n\n\n\n<p>Just as waste is a hindrance to thrift, so waste is a hindrance to frugality. Someone is spending lakhs of rupees on show or unnecessary entertainment. And a poor person next to him may not be able to buy medicine due to lack of money. A believer should remember that while saving, his name should not appear in the list of the miser, nor should his name appear in the list of the spendthrift. Without being miserly, spend in the sectors prescribed by Islam without any hesitation.<\/p>\n\n\n\n<p>If you are frugal, Allah Almighty will grant you a life free from poverty—that is what Rasul Karim (pbuh) predicted. On the authority of Abdullah Ibn Mas&#8217;ud (RA), the Prophet (PBUH) said, &#8216;He who spends moderately is not destitute. (Musnad Ahmad: 7\/303) That is, the person who practices moderation in spending, will not reach him. Today, many of us are deprived of the desired benefits due to not following this great teaching of Islam properly. Despite earning lakhs of rupees every month, there is a shortage.<\/p>\n\n\n\n<p>In the time of abundance, one should save the surplus money by adopting the path of thrift, avoiding spending in the festival of consumption completely, so that one does not have to face the situation of handing over to others for one&#8217;s needs in the future. It is mentioned in the Holy Qur&#8217;an, &#8216;You do not spend with your hands tied around your neck (by miserliness), and you do not become completely free (by being spendthrift), then you will sit condemned and destitute. (Bani Israel, verse 29)<\/p>\n\n\n\n<p>It is the teaching of Islam to collect the dues of relatives without wasting and wasting and to save some for the children as well as charity. The Prophet (PBUH) never liked leaving his children in the care of someone. Rasool Kareem (SAW) said, &#8216;It is better that you leave your heirs prosperous than to leave them at the mercy of people. (Bukhari: 1\/435; Muslim: 3\/1251)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Frugality is moderation in spending in daily life. That is, to spend according to need or calculation without being miserly.Thrift increases people&#8217;s wealth and opens the way to help others. Frugal people are never destitute. Thrift is one of the characteristics of a believer. From the verse number 63 of Surah Furqan of the Holy [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/86"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=86"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/86\/revisions"}],"predecessor-version":[{"id":95,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/86\/revisions\/95"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=86"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=86"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=86"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}