{"id":87,"date":"2024-02-20T08:16:11","date_gmt":"2024-02-20T08:16:11","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=87"},"modified":"2024-02-20T08:16:11","modified_gmt":"2024-02-20T08:16:11","slug":"peace-will-be-maintained-in-the-world-if-gods-words-are-obeyed","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/peace-will-be-maintained-in-the-world-if-gods-words-are-obeyed\/","title":{"rendered":"Peace will be maintained in the world if God&#8217;s words are obeyed"},"content":{"rendered":"\n<p>Once upon a time, when there was a crime somewhere, people used to protest against it. People used to warn someone if he indulged in any anti-social act in public.Socially tried to stop it. But now this trend has reduced a lot.<\/p>\n\n\n\n<p>Everyone likes to keep themselves busy. If he sees any sin, protesting against it is far from the case, he does not even try to understand the person who indulges in it using wisdom. But Allah Almighty has given every Muslim the responsibility of commanding good deeds and forbidding evil deeds. It is stated in the Holy Qur&#8217;an, You are the best Ummah, you have been revealed for mankind (overall welfare), enjoin good deeds and forbid evil deeds and keep faith in Allah.<br>(Surah: Ale-Imran, verse: 110)<\/p>\n\n\n\n<p>As long as people obey this message of Almighty Allah, peace will be maintained in the world and their superiority will be maintained. But if people deviate from their duty, the wrath of Allah will descend on them, and such wickedness will start in the society, their actions will make them inferior. On the authority of Sahabi Huzaifa Ibnul Yaman (R.A.), Rasulullah (S.A.W.) said, By the One in Whose Hand is my life! Surely you enjoin good deeds and forbid wrongdoing. If not, Allah Ta&#8217;ala will soon send His punishment upon you. Even if you pray to Him, He will not accept your prayers. (Tirmidhi, Hadith: 2169)<\/p>\n\n\n\n<p>The reason for this is that due to the sins of the servant, calamity befalls the world. The wrath of God Almighty increases. Those who have God, if they can not invite God-fearing people to the path of God; Rather, if they remain silent after seeing their crime, then the wrath of Almighty God will consume everyone. The Holy Prophet (PBUH) gave a unique example to illustrate the horror of giving up Da&#8217;wah, an example that cannot be compared to understand the importance of Da&#8217;wah.<\/p>\n\n\n\n<p>On the authority of Ma&#8217;an Ibn Bashir (RA), the Prophet (PBUH) said, &#8220;The example of those who abide within the limits set by Allah and those who transgress the limits is like that of a group of passengers who decided their place in a boat by lottery.&#8221; Some of them were placed on the upper floor and some on the ground floor (the water system was on the upper floor) so the people on the lower floor would drown the people on the upper floor while collecting water. Then the people of the lower floors said, If we make a hole in our part without causing trouble to the people of the upper floors (it is better), if they leave them to their own devices in this situation, then all will perish. And if they keep their hands (stop) then they and all will be saved. (Bukhari, Hadith: 2493)<\/p>\n\n\n\n<p>Therefore, we should all be steadfast in the way of Allah, enjoining good deeds and forbidding evil deeds. May Allah accept us all.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Once upon a time, when there was a crime somewhere, people used to protest against it. People used to warn someone if he indulged in any anti-social act in public.Socially tried to stop it. But now this trend has reduced a lot. Everyone likes to keep themselves busy. If he sees any sin, protesting against [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/87"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=87"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/87\/revisions"}],"predecessor-version":[{"id":94,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/87\/revisions\/94"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=87"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=87"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=87"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}