{"id":98,"date":"2024-02-22T12:43:31","date_gmt":"2024-02-22T12:43:31","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=98"},"modified":"2024-02-22T12:43:31","modified_gmt":"2024-02-22T12:43:31","slug":"how-much-shahbaz-government-can-handle-the-big-opposition-party-in-the-parliament","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/how-much-shahbaz-government-can-handle-the-big-opposition-party-in-the-parliament\/","title":{"rendered":"How much Shahbaz government can handle the big opposition party in the parliament"},"content":{"rendered":"\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/images.prothomalo.com\/prothomalo-bangla%2F2024-02%2F97b0a1ca-474e-4561-b604-8136329271d4%2FPakistan.webp?rect=0%2C0%2C640%2C360&amp;auto=format%2Ccompress&amp;fmt=webp&amp;format=webp&amp;w=640&amp;dpr=1.3\" alt=\"Pakistan Muslim League-Nawaz (PML-N) party president Shahbaz Sharif\"\/><\/figure>\n\n\n\n<p>Pakistan Muslim League-Nawaz (PML-N) and Pakistan Peoples Party (PPP) have already agreed to form a coalition government in Pakistan. After several days of power-sharing negotiations, the two parties reached an agreement on Tuesday night.<\/p>\n\n\n\n<p>On the other hand, independent candidates supported by Pakistan Tehreek-e-Insaf (PTI) formally joined the Sunni Ittehad Council party on Wednesday. They are now going to be the opposition party in the parliament. In such a situation, Dawn has published an editorial today about what is going to happen in the coming days.<\/p>\n\n\n\n<p>According to the editorial, according to the agreement between PPP and PML-N, Pakistan is once again getting a coalition government under the leadership of Shahbaz Sharif. The new government is set to take over less than seven months after the previous Shahbaz-led government was dissolved.<\/p>\n\n\n\n<p>PPP Co-Chairman Asif Ali Zardari has been nominated as President by PML-N and PPP. The Speaker of the National Assembly will be elected from the PML-N party. And the PPP leaders will be nominated as Senate Chairman and Governors of Khyber Pakhtunkhwa and Punjab.<\/p>\n\n\n\n<p>The two parties will form the government together in the provincial assembly of Balochistan. However, there is no guarantee that PPP will provide support to PML-N in all its activities after the formation of the government even if the complications are resolved.<\/p>\n\n\n\n<p>Only in the case of a no-confidence vote or the passage of an expenditure bill will PPP members vote for the PML-N. In other cases, PML-N will do as they wish.<\/p>\n\n\n\n<p>The PTI-backed winning independents have already joined the Sunni Ittehad Council. With this, the Sunni Ittehad Council is now the single largest party in the National Assembly of Pakistan. In that context, it can be said that the PTI party is going to be the opposition party in the National Assembly. At the same time, the leader of the opposition party will also be elected from among them.<\/p>\n\n\n\n<p>Shahbaz Sharif will have to face the biggest political test while running the government in such a situation. He did not really face any kind of opposition during the previous government.<\/p>\n\n\n\n<p>It is said in the editorial, this year&#8217;s parliament will not be the same parliament. Shahbaz has to show bravery in this Parliament. Even the legitimacy of the government led by him may be challenged. It has been alleged that they are forming the government by &#8216;stealing the public&#8217; in the February 8 elections.<\/p>\n\n\n\n<p>Shahbaz Sharif&#8217;s biggest task will be to clean up the mistakes made by his previous administration; Especially in the economic field.<\/p>\n\n\n\n<p>A large section of the Pakistani public is angry with the election results. Citizens are almost bankrupt due to continued inflation. In such a situation, Pakistan&#8217;s economy needs major changes, but the task will not be easy for Shahbaz. He will surely face resistance from the people.<\/p>\n\n\n\n<p>Shahbaz Sharif says he wants to &#8216;protect&#8217; Pakistan. However, many people are now looking at how long he can hold his position.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Pakistan Muslim League-Nawaz (PML-N) and Pakistan Peoples Party (PPP) have already agreed to form a coalition government in Pakistan. After several days of power-sharing negotiations, the two parties reached an agreement on Tuesday night. On the other hand, independent candidates supported by Pakistan Tehreek-e-Insaf (PTI) formally joined the Sunni Ittehad Council party on Wednesday. They [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1,2],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/98"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=98"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/98\/revisions"}],"predecessor-version":[{"id":102,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/98\/revisions\/102"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=98"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=98"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=98"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}