{"id":99,"date":"2024-02-22T12:43:03","date_gmt":"2024-02-22T12:43:03","guid":{"rendered":"https:\/\/mpa.uk.com\/?p=99"},"modified":"2024-02-22T12:43:03","modified_gmt":"2024-02-22T12:43:03","slug":"why-american-citizen-malak-silmi-left-journalism","status":"publish","type":"post","link":"https:\/\/mpa.uk.com\/why-american-citizen-malak-silmi-left-journalism\/","title":{"rendered":"Why American citizen Malak Silmi left journalism"},"content":{"rendered":"\n<p>Malak Silmi, an American of Palestinian origin, lives in the US state of Michigan. He graduated from Wayne State University in journalism and international studies. He has done journalism in several American newspapers. Currently he is working as a freelance journalist. He wrote in Al Jazeera last January 28<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/images.prothomalo.com\/prothomalo-bangla%2F2024-02%2F868dcfd2-76a4-4fe9-9f5e-50ae56932e44%2Fmalak_silmi.jpg?rect=0%2C0%2C700%2C394&amp;auto=format%2Ccompress&amp;fmt=webp&amp;format=webp&amp;w=640&amp;dpr=1.3\" alt=\"Malak Silmi\"\/><\/figure>\n\n\n\n<p>Malak Silmi&nbsp;<em>Photo: Taken from Facebook<\/em><\/p>\n\n\n\n<p>Dearborn, Michigan is one of the cities in the United States where a large proportion of the Arab population lives. When I joined journalism, I found myself alone, even though there were people like me around. Others went on to study subjects such as engineering and medicine.<\/p>\n\n\n\n<p>I grew up in the US in a town where people don&#8217;t really believe what they hear in the media. Because, here the news about the Middle East and Muslim and Arab community is printed or disseminated by hiding the wrong and real information for years. Most of the times we have seen us portrayed negatively or labeled as terrorists in the news pages. So the Arab families I grew up with never listened to these news stories.<\/p>\n\n\n\n<p>In 2000, father moved to this city with his family. A man who has traveled around different countries, never thought of settling down, his family becomes a permanent address after the terrorist attacks of 9-11. He clung to the family and did not want to move anywhere. He built a protective circle around this city in his mind, which he rarely crossed.<\/p>\n\n\n\n<p>I was only two years old at the time of 9-Eleven. So what effect it had at the time, I don&#8217;t remember. But I can say, I grew up in a family that never went anywhere except Jordan and Palestine. People used to visit Mackinac Island on summer vacation. And I didn&#8217;t set foot there until I was 21.<\/p>\n\n\n\n<p>We went on a hike to the nearby Great Lakes. But I didn&#8217;t visit Lake Michigan, two and a half hours away. Because, to go there, you have to go through several Republican counties. And father used to think that since mother and I wear hijab, we might have to hear all sorts of bad things from which he cannot protect us.<\/p>\n\n\n\n<p>I was quite angry with the &#8216;narrow&#8217; mentality of people in my community. Later I understood why my parents took such a decision for us. One reason for their fear was the US media coverage of the invasions of Afghanistan and Iraq, and another was the Western policies of exploiting Muslims under the guise of anti-terrorist operations after 9\/11.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>After seeing the printed report, I felt like crying in an empty apartment. It seemed that someone had stopped my voice. I was dying of shame for those protesting people.<\/p>\n<\/blockquote>\n\n\n\n<p>I want to become a journalist to change this situation. I wanted to tell the right story and hold people in power accountable.<\/p>\n\n\n\n<p>Taught in college, journalism can change government policies, expose their secret activities, lies, and exonerate the wrongfully convicted. These words are etched in my mind. I want to use this power for myself and my community, who have been the target of media and government censure day after day.<\/p>\n\n\n\n<p>I started writing stories and reporting in the campus newspaper. Interned at several media organizations in Michigan. I even had the opportunity to intern at the New York Times for two weeks.<\/p>\n\n\n\n<p>The family was enjoying this journalism of mine. After college, I got a full-time job at a local newspaper in Texas in 2021. I was the only Muslim and Palestinian in the newsroom there. I did about 400 reports there in a year on breaking news and trending topics.<\/p>\n\n\n\n<p>Among these reports, there was one report, which I was hesitant to do or not. I regretted it later. It was a protest against a church raising funds for Israel.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Malak Silmi, an American of Palestinian origin, lives in the US state of Michigan. He graduated from Wayne State University in journalism and international studies. He has done journalism in several American newspapers. Currently he is working as a freelance journalist. He wrote in Al Jazeera last January 28 Malak Silmi&nbsp;Photo: Taken from Facebook Dearborn, [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[1,2],"tags":[],"_links":{"self":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/99"}],"collection":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/comments?post=99"}],"version-history":[{"count":1,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/99\/revisions"}],"predecessor-version":[{"id":101,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/posts\/99\/revisions\/101"}],"wp:attachment":[{"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/media?parent=99"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/categories?post=99"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/mpa.uk.com\/wp-json\/wp\/v2\/tags?post=99"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}